_posts/2014-04-22-computing-theory.html
---
category: computer science and enginneering
layout: post
title: "Rough Thought about Computer"
tags: ["computer",computing]
---
{% include JB/setup %}

<p>
很多时候，都在思考，经常需要充电的内容： 数理逻辑、算法、操作系统、
系统编程、语言理论、面向对象理论，数学等，那这些看似零散的知识，它的本质是什么呢？
为什么要学这么多呢，经常听到，诸如“你要是知道什么什么，这些就不难了”，
仔细想想，这些其实都是有关使用计算机进行计算的本质问题，因为计算机的理
解，本身就不能单一的进行，它包括下面这些已经总结的公式：
</p>
<ul class="org-ul">
<li>Computing = Computers Computing is about solving problem using
Computers。
</li>
<li>Computing = Programming Computing is about writing programs for
computers
</li>
<li>Computing = Software computing is not concerned with hardware design
</li>
</ul>

<p>
而所有这一切，确实可以总结为科学和工程的问题？ 
</p>

<p>
lambda演算研究如何用数学来描述这个世界，以及在这个世界上的问题。
</p>

<p>
Object-Orientation is an approach to designing modular, reusable
software system。
</p>
